<?php 

    require_once 'plugin_database.php';
    
    // Вставляється в базу даних при створенні бази:
    class goal 
    {
        public $goal = array(
            'Рутина' => array(
                'Приготувати їжу',
                'Поїсти',
                'Одягнутись',
                'Купити',
                'Розваги' => array(
                    'Подивитись відео на ютуб',
                    'Почитати',
                    'Посидіти в чаті',
                    'Посидіти в чаті'
                ),
            ),
            'Задача' => array(
                'Робота',
                'Навчання'
            ),
            'Гештальт', // що хочу попробувати
            'Платежі', // регулярні, хостинг
            'Покупки', // продукти, речі, догляд
            
            //
            'Публікації' => array(
                'VK',
                'FB',
                'INST',
                'TG',
                'YouTube',
            )
        );
    }
    
    // Нагадування в планері - це тригерна система!
    
    /*
        Скільки у мене було перерв між завданнями?
        Скільки часу залишилось до кінця поточної задачі?
        Нагадувалки: чи не забув я поїсти і поспати? Мені тепло? 
            І записувати відповіді в базу:
                - так, я ситий
                - ні, я не можу поїсти
                - ні, я н хочу їсти
                - не впевнений
    
        Рекомендатор: Не назначай задачі автоматично, а показуй рекомендовані задачі на обраний день (на завтра)
    */
    
    
    
    $className = basename(pathinfo(__FILE__)['dirname']);
    $usp_planner = new $className; 

    // Якщо чітко вказано, що це запит до плагіну:
    if ($_POST['actionTo'] == 'plugin') {
        
        // якщо чітко вказано, що це запит до цього плагіну:
        if ($_POST['pluginFolder'] == basename(pathinfo(__FILE__)['dirname'])) {
            
            // тільки тоді виконую якусь дію:
            if (isset($_POST['action'])) {
                
                ##############################################
                
                // Дія:
                if ($_POST['action'] == 'addNote') {
                    
                    // update in db:
                    $array = array(
                    "INSERT INTO" => $usp_planner->tablesNames[0],
                        "COLUMNS" => array(
                            "text" => nl2br($_POST['text'])
                            )                            
                    );
                            
                    $db->insert($array); 
                    
                    $link = $pluginConfigUrl;
                    
                    header ("Location: $pluginConfigUrl");
                    exit();
                    
                } // <-- Дія

            } // <-- кінець виконання дій
        } // <-- кінець перевірки папки плагіну
    } // <-- кінець перевірки запиту до плагіну
     
