<div class="container-fluid">
    <div class="container center">
    <h2><?php echo dialogs(100,$language); ?></h2>
    </div>
</div>
<div class="container-fluid">
    <p>Щоб полегшити собі створення лендінгів, тут я задам собі натякаючі питання. Розділи будуть такі:</p>
    <ul>
        <li>Як з нами звязатись?</li>
        <li>В чому суть наших послуг?</li>
        <li>Які наші переваги?</li>
        <li>Скільки коштує наша послуга?</li>
        <li>Хто ми такі?</li>
        <li>Які у нас є соціальні докази?</li>
    </ul>
    <p>Суть USP CMS у тому, щоб максимально детально розглянути всі елементи, з яких складається реклама (маркетинг), групувати їх, розмножувати, копіювати. Система має підказувати мені що я повинен написати.</p>
    <h2>Моя ціль - розібратись у маркетингу</h2>
    <p>Я структурую свої знання у вигляді скрипта. І буду користуватись ним так, як радять спеціалісти по маркетингу.</p>  
    <h2>Суть бази даних у накопиченні знань</h2>
    <p>У базі даних я зберігаю тільки текст. В шаблоні буде функція для виводу <code>show('title',1);</code>. Тому моя верстка буде легкою для читання.</p>
    <h2>Стилі мають бути легкодоступні, щоб я не шпортався об них</h2>
    <p>А в CSS у кожному розділі у мене вже будуть заготовлені стилі, які я буду редагувати. Всюди поставлю собі надписи, щоб я знав, що можна змінювати, а що ні. І що за що відповідає.</p>
</div>
