<?php

    require_once 'plugin_database.php';

    $usp_questionnaire = new usp_questionnaire;
    
/*
  Питання можуть бути:
  - обовязкові
  - одаткові
  - уточнюючі

  Чим більше інформації ми витягнемо з клієнта, тим менше проблем і непорозумінь буде при розробці.

  Скіьки часу займає опитування?
  Скільки максимально і мінімально питань треба, щоб клієнт відчув, що ми професіонали?
*/
    function getQuestionsToCustomer($language) {
        global $form;

        $className = basename(pathinfo(__FILE__)['dirname']);
        $usp_questionnaire = new $className; 
        
        if ($language == 'ukraine') {
          $questionsToCustomer = array(
              0 => array(
                  'question' => 'Які послуги ви надаєте?',
                  'hint' => 'Введіть перелік послуг через кому',
                  'form' => array (
                      $form->hidden(array('name'=> 'questionID','value'=> 0)),
                      $form->textarea(array('name'=> 'services','value'=> '','class'=>'form-control'))
                    )
             ),
             1 => array(
                 'question' => 'Які найбільші переваги Вашої послуги?',
                 'hint' => 'Чому клієнт має скориститись Вашими послугами, а не чиїмись іншими? Введіть перелік послуг через кому. Бажано три переваги.',
                 'form' => '<textarea class="form-control" rows="5" id="comment"></textarea>'
              ),
              2 => array(
                  'question' => 'Які проблеми клієнта вирішує Ваша послуга?',
                  'hint' => 'Введіть назву проблеми та опис, яким способом Ви її вирішуєте. Бажано три найбільші проблеми Ваших клієнтів.',
                  'form' => '<textarea class="form-control" rows="5" id="comment"></textarea>'
              ),
              3 => array(
                 'question' => 'Яким способом клієнти мають з Вами зв\'язуватись?',
                 'hint' => 'Введіть через кому, якщо у вас декілька телефонів.',
                 'form' => array(
                      '<p>Телефони:</p>',
                      '<textarea class="form-control" rows="5" id="comment"></textarea>',
                      '<p>Поштові скриньки:</p>',
                      '<textarea class="form-control" rows="5" id="comment"></textarea>',
                      '<p>Адреси:</p>',
                      '<textarea class="form-control" rows="5" id="comment"></textarea>',
                 ) // тут треба багато форм
              ),
              4 => array(
                 'question' => 'Які з перелічених емоцій має викликати Ваш сайт?',
                 'hint' => 'Максимально можна обрати 5 емоцій',
                 'form' => '' // чекбокс, тут треба JS
              ),
              5 => array(
                 'question' => 'Які з перелічених асоціацій має викликати Ваш сайт?',
                 'hint' => 'Максимально можна обрати 5 емоцій',
                 'form' => '' // чекбокс, тут треба JS
              ),
              6 => array(
                 'question' => 'Оберіть епітети, якими ви би описали свою послугу.',
                 'hint' => 'Максимально можна обрати 5 емоцій',
                 'form' => '' // чекбокс, тут треба JS
              ),
              7 => array(
                 'question' => 'Якби ми могли заставити Ваших клієнтів повірити і будь-що, але тільки  у щось одне, що Ви хотіли би, щоб ми сказали Вашим клієнтам?',
                 'hint' => 'Напишіть одне речення. Наприклад: "Наша послуга найкраща"',
                 'form' => '<textarea class="form-control" rows="5" id="comment"></textarea>'
              ),
              8 => array(
                 'question' => 'Які з перелічених функцій Вам потрібні?',
                 'hint' => 'Можна обрати всі',
                 'form' =>  '' // множинний вибір
              ),
              9 => array(
                 'question' => 'Чи є щось, чого ви точно НЕ ХОЧЕТЕ на сайті?',
                 'hint' => 'Напишіть своїми словами',
                 'form' =>  '<textarea class="form-control" rows="5" id="comment"></textarea>' // галочка "я довіряю вам""
              ),
              10 => array(
                 'question' => 'Відмітьте ті інформаційні блоки, які ви хочете бачити на сайті.',
                 'hint' => '',
                 'form' =>  ''// множинний вибір, частина вже відмічена
              ),
              11 => array(
                 'question' => 'Які дії повинен зробити Ваш клієнт після перегляду сайту?',
                 'hint' => 'Заталефонувати Вам, написати на пошту, підписатись на сторінку у соціальній мережі, прийти в офіс по вказаному адресу',
                 'form' =>  ''// іншу дію, ввеіть словами, тут одиничний вибір, або текстове поле: JS
              ),
              12 => array(
                 'question' => 'Чи є у Вас готовий продающий скрипт (ВИПРАВ НАЗВУ!), або готове УТП?',
                 'hint' => 'Скрипт ляже в основу елементів заклику до дії',
                 'form' =>  '' // форма для завантаження файлу
              ),
              13 => array(
                 'question' => 'Додаткові побажання',
                 'hint' => 'Якщо ви хочете щось додати, напишіть у довільній формі свої побажання',
                 'form' =>  '<textarea class="form-control" rows="5" id="comment"></textarea>' // форма для завантаження файлу
              ),
              14 => array(
                 'question' => 'Чи виникали у Вас якісь перешкоди у розробці сайту раніше?',
                 'hint' => 'Ви можете розповісти з якими перешкодами Ви вже стикались раніше, щоб ми могли усунути їх заздалегідь',
                 'form' =>  '<textarea class="form-control" rows="5" id="comment"></textarea>' // щоб витягнути побільше інформації для заперечень
              ),
              15 => array(
                 'question' => 'Згода на обробку персональних даних',
                 'hint' => 'На вказаний вами емайл прийдет документ зі всіма відповідями',
                 'form' =>  '' // тут чекбокс "я згоден", текстове поле для ввода емайлу і кнопка для відправки
              ),
         );
        } else if ($language == 'russian') {
           $questionsToCustomer = array();
        }

        return $questionsToCustomer;
    }

  /*
    TODO:
    Усі поля менеджер заповняє сам. Просто зачитує клієнту в слух і коментує. (тоді нема вкладення)
    Якщо клієнт сам скаже, що хоче заповнити форму, то можна передати йому управління. (тоді нема відчуття персональної уваги)
    Але бажано, щоб менеджер все робив замість клієнта. (де тоді вкладення?)

    У менеджера відображається 2 переключателя:
    1) своє вікно, в якому він вводить відповіді
    2) форма для вибору вікна, яке показується клієнту, і чекбокс доступності редагування
      - менеджер може переглядати любі питання, а клієнту показується те, що у формі для вибору вікна
      - кожну 1 сек JS скрипт перевіряє значення з форми. Якщо не змінилось - нічого не робить, тільки вписує введені менеджером дані.
      - якщо змінилось вікно, то перезавантажує сторінку з новим вікном.
      - можна розблокувати тільки 1 питання, а можна всі одразу (ті, що введені просто відображай як затверджені, а ті що не знає - розблоковано для вводу у інший час)

    3) Після останнього запитання управління передається клієнту. Йому показується всі відповіді, які він надав у вигляді сторінки,
    чекбокс "даю згоду на обробку персональних даних", поле ввода емайл і кнопка "відправки".

    Якщо клієнт натискає кнопку відправки, йому приходить документ в форматі .DOC зі згенерованих технічним завданням на розробку сайту
    та імям і контактами менеджера, який його веде. Такий самий файл попадає і на нашу пошту (для звіту).
  */



    // Якщо чітко вказано, що це запит до плагіну:
    if ($_POST['actionTo'] == 'plugin') {

        // якщо чітко вказано, що це запит до цього плагіну:
        if ($_POST['pluginFolder'] == 'usp_questionnaire') {

            // тільки тоді виконую якусь дію:
            if (isset($_POST['action'])) {

                ##############################################

                // Дія :
                if ($_POST['action'] == '') {

                    $link = $pluginConfigUrl."&plugin_config=money_config";

                    header ("Location: $link");
                    exit();

                } // <-- Дія



            } // <-- кінець виконання дій

        } // <-- кінець перевірки папки плагіну

    } // <-- кінець перевірки запиту до плагіну
