<?php 

    #   USP plugin: Landing
    #   version: 1.0
    #   author: Vlad Salabun
    #   Description: Дозволяє вводити всю інформацію через адмінку, і зберігати її у базі даних. А в коді шаблону вставляти з допомогою шорткоду echo <code>show($n);</code>. Головна перевага у тому, що можна використовувати його як чек-лист того, що треба ще зробити і на які питання відповісти, щоб зробити лендинг. 
    #   Activation: yes



    /*
        TODO: Додавання елементів лендінгу, щоб швидко згенерувати УТП
    */

