<?php

    // TODO: чи видно змінні з одного плагіну в іншому?

    require_once 'plugin_database.php';

/*
  Питання можуть бути:
  - обовязкові
  - одаткові
  - уточнюючі

  Чим більше інформації ми витягнемо з клієнта, тим менше проблем і непорозумінь буде при розробці.

  Скіьки часу займає опитування?
  Скільки максимально і мінімально питань треба, щоб клієнт відчув, що ми професіонали?
*/
    function getCorporateBlogPosts($categoryID) {
        global $form;

        return $questionsToCustomer;
    }

  /*
    TODO:
    1) скачати кожен розділ у вигляді книжки для друку, щоб давати працівникам

  */



    // Якщо чітко вказано, що це запит до плагіну:
    if ($_POST['actionTo'] == 'plugin') {

        // якщо чітко вказано, що це запит до цього плагіну:
        if ($_POST['pluginFolder'] == 'usp_questionnaire') {

            // тільки тоді виконую якусь дію:
            if (isset($_POST['action'])) {

                ##############################################

                // Дія :
                if ($_POST['action'] == '') {

                    $link = $pluginConfigUrl."&plugin_config=money_config";

                    header ("Location: $link");
                    exit();

                } // <-- Дія



            } // <-- кінець виконання дій

        } // <-- кінець перевірки папки плагіну

    } // <-- кінець перевірки запиту до плагіну
