<div id="middle" class="container-fluid">
  <div id="about_me" class="container">
    <div class="col-lg-6 col-md-6 col-sm-6 col-xs-6 margin20">

    <p class="center"><img src="<?php echo $webSiteUrl; ?>themes/salabun/img/mission.png"></p>
    <h2 class="padding20">
      В чому моя місія?
    </h2>
     
    <p>
      Я пропоную нові ідеї та творчі рішення, бо хочу бачити довкола якісні послуги і товари, вироблені в Україні. Замовляючи у мене сайти, ви інвестуєте у здорове майбутнє країни.
    </p>
    </div>
    <div class="col-lg-6 col-md-6 col-sm-6 col-xs-6 margin20">
    <p class="center"><img src="<?php echo $webSiteUrl; ?>themes/salabun/img/solve.png"></p>
    <h2 class="padding20">
      Які проблеми я вирішую? В чому мій талант?
    </h2>
     
    <p>
      Я зроблю для вас сайт, який візьме на себе частину Вашої роботи. Створю таку цифрову форму для ваших послуг, якою люди захочуть користуватись. Допоможу Вам зробити такий сайт, щоб Ваші клієнти отримували задоволення від Вашого сервісу і хотіли придбати Ваші послуги.
    </p>
    </div>
    <div class="col-lg-6 col-md-6 col-sm-6 col-xs-6 margin20">
    <p class="center"><img src="<?php echo $webSiteUrl; ?>themes/salabun/img/strategy.png"></p>
    <h2 class="padding20">
      Яка моя стратегія виготовлення сайтів? Як я дію?
    </h2>
     
    <p>
      Я старанно обмірковую кожну деталь веб-сайту, бережу її і терпеливо розробляю. Це мій спосіб показати, як я ціную хорошу роботу. Кожен блок я верстаю з любовю і на користь людям.
    </p>
     
    <p>
      Якщо Вам подобається хід моїх думок та мої роботи, телефонуйте і замовляйте у мене розробку сайту.
    </p>
    </div>
    <div class="col-lg-6 col-md-6 col-sm-6 col-xs-6 margin20">

    <p class="center"><img src="<?php echo $webSiteUrl; ?>themes/salabun/img/grafik.png"></p>
    
    <h2 class="padding20">
      Який у мене робочий графік?
    </h2>
     
    <p>
      На листи відповідаю кожного дня о 12:00 та о 19:00 по Києвському часі.
    </p>
     
    <p>
      Я обов'язково приділяю увагу кожному моєму відвідувачеві, бо я дуже люблю спілкуватись і допомагати людям. Проте написання програмного коду займає більшу частину моєї уваги. Тому, якщо у вас є питання, яке потребує більше, ніж 5 хвилин обговорення, будь ласка, надішліть свої запитання на мою електронну скриньку.
    </p>
    </div>
  </div>
</div>